day-03/simulation_foil/foil_gmsh_mesh/transient/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (10 0 0);

boundaryField
{
	inlet
	{
		type            freestreamVelocity;
        freestreamValue $internalField;
	}
	
	outlet
	{
		type            freestreamVelocity;
        freestreamValue $internalField;
	}
	
	top
	{
		type            symmetryPlane;
	}

	bottom
	{
		type            symmetryPlane;
	}

	foilup
	{
		type            noSlip;
	}

	foillow
	{
		type            noSlip;
	}

	defaultFaces
	{
		type            empty;
	}
}

// ************************************************************************* //
