day-03/simulation_foil/foil_gmsh_mesh/transient/0.org/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 10;

boundaryField
{
    inlet
	{
		type            freestream;
        freestreamValue $internalField;
	}
	
	outlet
	{
		type            freestream;
        freestreamValue $internalField;
	}
	
	top
	{
		type            symmetryPlane;
	}

	bottom
	{
		type            symmetryPlane;
	}

	foilup
	{
		type            nutUSpaldingWallFunction;
        value           uniform 0;
	}

	foillow
	{
		type            nutUSpaldingWallFunction;
        value           uniform 0;
	}

	defaultFaces
	{
		type            empty;
	}
}

// ************************************************************************* //
