day-03/simulation_foil/foil_gmsh_mesh/transient/system/forces
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

// Mandatory entries
type            forceCoeffs;
libs            ("libforces.so");
patches         ("foil.*");

// Optional entries

// Field names
p               p;
U               U;
rho             rhoInf;

// Reference pressure [Pa]
pRef            0;

// Include porosity effects?
//porosity        no;

// Store and write volume field representations of forces and moments
writeFields     yes;

// Centre of rotation for moment calculations
CofR            (1 0 0);

// Lift direction
liftDir         (0 1 0);

// Drag direction
dragDir         (1 0 0);

// Pitch axis
pitchAxis       (0 0 1);

// Freestream velocity magnitude [m/s]
magUInf         60;

// Free stream density [kg/m3]
rhoInf         1.2;

// Reference length [m]
lRef            1;

// Reference area [m2]
Aref            1;

// ************************************************************************* //
